tap "blacktop/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "michaeleisel/zld"
tap "robotsandpencils/made"
tap "saagarjha/tap"
brew "aria2"
brew "openssl@1.1"
brew "python@3.10"
brew "autojump"
brew "bat"
brew "carthage"
brew "chisel"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "openldap"
brew "curl"
brew "exa"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "mpg123"
brew "srt"
brew "ffmpeg"
brew "fish"
brew "fisher"
brew "freetds"
brew "fzf"
brew "libavif"
brew "gd"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "go"
brew "ios-deploy"
brew "libev"
brew "libpq"
brew "libxml2"
brew "lsd"
brew "lua"
brew "lua@5.3"
brew "luajit"
brew "luarocks"
brew "mas"
brew "python@3.11"
brew "mercurial"
brew "tree-sitter"
brew "neovim"
brew "ninja"
brew "node"
brew "openjdk", link: true
brew "parallel"
brew "php"
brew "pidof"
brew "protobuf"
brew "radare2"
brew "ripgrep"
brew "rsync"
brew "streamlink"
brew "switchaudio-osx"
brew "telnet"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tokei"
brew "trash"
brew "typescript"
brew "wget"
brew "youtube-dl"
brew "yt-dlp"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "blacktop/tap/ipsw"
brew "robotsandpencils/made/xcodes"
brew "saagarjha/tap/unxip"
cask "appcleaner"
cask "bettertouchtool"
cask "clashx"
cask "font-hack-nerd-font"
cask "fork"
cask "hammerspoon"
cask "iina"
cask "imageoptim"
cask "karabiner-elements"
cask "keka"
cask "launchbar"
cask "lookin"
cask "losslesscut"
cask "lyricsx"
cask "microsoft-edge"
cask "monitorcontrol"
cask "mos"
cask "netnewswire"
cask "omnidisksweeper"
cask "provisionql"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklookase"
cask "shottr"
cask "sublime-merge"
cask "sublime-text"
cask "syntax-highlight"
cask "transmission"
cask "visual-studio-code"
cask "warp"
cask "webpquicklook"
cask "wwdc"
cask "xld"
cask "xmind"
mas "2Do", id: 477670270
mas "App Language Chooser", id: 451732904
mas "Apple Configurator", id: 1037126344
mas "Flow", id: 1423210932
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "WeChat", id: 836500024
